paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/refundSale.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.refundsale">
  <soapenv:Header/>
   <soapenv:Body>
   <urn:Paypal>
   	<urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
   	<urn:authorization>Bearer 7RDA.3yMKBJrpm.wu-3FPuJ1r7mXqfe6mcIehN64CWE</urn:authorization>     
   	<urn:id>49F843921U4201544</urn:id>
   	<urn:amount>1.00</urn:amount>
   	<urn:currCode>USD</urn:currCode>
   </urn:Paypal>
   </soapenv:Body>
</soapenv:Envelope>
